Source Code/Cloud App/app/controllers/appusers_controller.rb

  def index
    if current_user.userType != 0
      @appuser = Appuser.where("charityid = ?",current_user.charityid)
    else
      @appuser = Appuser.all
---
SELECT "appusers".* FROM "appusers"