Source Code/Cloud App/app/controllers/medications_controller.rb

  def index
    @medications = Medication.order(:name)
---
SELECT "medications".* FROM "medications" ORDER BY "medications"."name"