Source Code/Cloud App/app/controllers/sessions_controller.rb

    def create
        user = User.find_by_userName(params[:session][:userName].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."userName" = 'epere250' LIMIT 1