Source Code/Cloud App/app/controllers/static_pages_controller.rb

  def home
  	@patients = Patient.order(:updated_at)
---
SELECT "patients".* FROM "patients" ORDER BY "patients"."updated_at"