Source Code/Cloud App/app/controllers/users_controller.rb

  def index
    if current_user.userType != 0
      @users = User.where("userType = ? and charityid = ?",current_user.userType,current_user.charityid)
    else
      @users = User.all
---
SELECT "users".* FROM "users"